## Overview
- Client: Microsoft
- Business Questions: "Launch New Movie Studio? (for Original Video content) 
- Current Task: Understand Movie Industry
    1. Data analysis - "what type of films are currently doing the best at the box office?"
    2. **5 min presentation** - "what type of films they should be creating"
    
## Data Analysis    
- "what **type of films** are **currently** doing the **best at the box office**?"
    - Data Available
        - Data source (use >=2)
            - ( )Box Office Mojo
            - ( )IMDB
            - ( ) Rotten Tomatoes
            - ( )TheMovieDB.org
        -  Movie Features of interest (genres,ratings,budget, social media discussion,critic or user reviews)
    - Analysis Required 
        - ( ) 1 joined/cleaned dataset
        - ( ) 4 visualization 
        - ( ) 2 summary table
    - Qs to answer
        - ( ) type of movie to recommend? 
        - ( ) budget requirement? 
        - ( ) recuiting (cast, director...)?

### Libraries

In [184]:
# import libraries 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

### Data Set Expolre

In [185]:
!ls /Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data

bom.movie_gross.csv.gz       imdb.title.ratings.csv.gz
imdb.name.basics.csv.gz      rt.movie_info.tsv
imdb.title.akas.csv.gz       rt.movie_info.tsv.gz
imdb.title.basics.csv.gz     rt.reviews.tsv.gz
imdb.title.crew.csv.gz       tmdb.movies.csv.gz
imdb.title.principals.csv.gz tn.movie_budgets.csv.gz

#### Read in Datasets

- Box Office Mojo

In [186]:
#inspect data on command line without unzipping, 
# you can use gzip -cd <filename> | head 
# (I like to think -cd stands for Continuous Decompress).

#!gzip -cd /Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/bom.movie_gross.csv.gz|head

In [187]:
bom = pd.read_csv('./data/bom.movie_gross.csv.gz')
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

- IMDB
    - tab-separated-values (TSV) formatted file in the UTF-8 character set

In [188]:
imdb_datasets = ['imdb.name.basics.csv.gz',
                'imdb.title.akas.csv.gz',
                'imdb.title.basics.csv.gz',
                'imdb.title.crew.csv.gz',
                'imdb.title.principals.csv.gz',
                'imdb.title.ratings.csv.gz']
url=[]
for dataset in imdb_datasets:
    url.append('./data/'+dataset)

In [189]:
imdb_name_basics = pd.read_csv(url[0])
imdb_tl_akas = pd.read_csv(url[1])
imdb_tl_basics = pd.read_csv(url[2])
imdb_tl_crew = pd.read_csv(url[3])
imdb_tl_principals = pd.read_csv(url[4])
imdb_tl_ratings = pd.read_csv(url[5])

- Rottem Tomatoes

In [190]:
#!gzip -cd /Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_3_project/data/rt.movie_info.tsv.gz|head

In [191]:
url_rt1 = './data/rt.movie_info.tsv.gz'
rt_movie_info = pd.read_csv(url_rt1, sep = '\t')

In [192]:
url_rt2 = './data/rt.reviews.tsv.gz'
rt_reviews=pd.read_csv(url_rt2, sep = '\t',  encoding='mac_roman')

- MovieDB

In [193]:
url_rt3 = './data/tmdb.movies.csv.gz'
tmdb_movies = pd.read_csv(url_rt3)

In [194]:
url_rt4 = './data/tn.movie_budgets.csv.gz'
tmdb_budgets = pd.read_csv(url_rt4)

#### Box Office Mojo

In [195]:
bom.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

#### IMDb

In [196]:
imdb_name_basics.head(2)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

In [197]:
imdb_tl_akas.head(2)

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0

In [198]:
imdb_tl_basics.head(2)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [199]:
imdb_tl_crew.head(2)

      tconst  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973        NaN  nm0175726,nm1802864

In [200]:
imdb_tl_principals.head(2)

      tconst  ordering     nconst  category  job   characters
0  tt0111414         1  nm0246005     actor  NaN  ["The Man"]
1  tt0111414         2  nm0398271  director  NaN          NaN

In [201]:
imdb_tl_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

#### RT

In [132]:
rt_movie_info.head(2)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One

In [133]:
rt_reviews.head(2)

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"

#### TMDB

In [134]:
tmdb_movies.head(2)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

In [202]:
tmdb_budgets.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

### Movies 
- All About Money ()
    - bom 
    - tmdb

In [136]:
bom.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

In [138]:
tmdb_movies.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

In [203]:
tmdb_budgets['id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [140]:
tmdb_movies['id'].unique()

array([ 12444,  10191,  10138, ..., 381231, 366854, 309885])

In [141]:
bom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [204]:
tmdb_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

In [143]:
tmdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

### bom + tmdb + imdb

1. Limit tmdb data to 2010-2018 
    - parse to Y, m, d,(keep month, date)
2. join tables by movie title
    - check movie name difference in the tables

In [144]:
bom['year'].unique()

array([2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018])

1. Limit tmdb data to 2010-2018 
    - parse to Y, m, d,(keep month, date)

In [205]:
# check data format
tmdb_budgets['release_date'].head()

0    Dec 18, 2009
1    May 20, 2011
2     Jun 7, 2019
3     May 1, 2015
4    Dec 15, 2017
Name: release_date, dtype: object

In [206]:
# check 
tmdb_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [207]:
tmdb_budgets['date'] = pd.to_datetime(tmdb_budgets['release_date'])
tmdb_budgets['year'] = tmdb_budgets['date'].dt.year
tmdb_budgets['month'] = tmdb_budgets['date'].dt.month

In [208]:
# slicing dataset 2010-2019
mask = (tmdb_budgets['year']<=2019) & (tmdb_budgets['year']>=2010)
tmdb_budgets = tmdb_budgets.loc[mask].copy()

In [209]:
# tmdb_movies
tmdb_movies.head(2)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

In [152]:
tmdb_movies['release_date'].head()

0    2010-11-19
1    2010-03-26
2    2010-05-07
3    1995-11-22
4    2010-07-16
Name: release_date, dtype: object

In [153]:
tmdb_movies['date'] = pd.to_datetime(tmdb_movies['release_date'])

In [154]:
# add year & month to tmdb_movies
tmdb_movies['year'] = tmdb_movies['date'].dt.year
tmdb_movies['month']= tmdb_movies['date'].dt.month
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,date,year,month
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,2010-11-19,2010,11
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,2010-03-26,2010,3
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,2010-05-07,2010,5
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174,1995-11-22,1995,11
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,2010-07-16,2010,7

In [155]:
# slice tmdb_movies (year 2010-2019)
mask = (tmdb_movies['year']<=2019) & (tmdb_movies['year']>=2010)
tmdb_movies = tmdb_movies.loc[mask].copy()

## try join 2 tables from tmdb

In [211]:
tmdb_movies['title'].head()

0    Harry Potter and the Deathly Hallows: Part 1
1                        How to Train Your Dragon
2                                      Iron Man 2
3                                       Toy Story
4                                       Inception
Name: title, dtype: object

In [210]:
tmdb_budgets['movie'].head()

1    Pirates of the Caribbean: On Stranger Tides
2                                   Dark Phoenix
3                        Avengers: Age of Ultron
4              Star Wars Ep. VIII: The Last Jedi
5           Star Wars Ep. VII: The Force Awakens
Name: movie, dtype: object

In [212]:
bom['title'].head()

0                                    Toy Story 3
1                     Alice in Wonderland (2010)
2    Harry Potter and the Deathly Hallows Part 1
3                                      Inception
4                            Shrek Forever After
Name: title, dtype: object

## Check overlapping movie titles in 4 datasets: bom, tmdb_budgets (num), tmdb_movies (tmdb), imdb_tl_basics

In [164]:
# 1699 btw tmdb_budgets & tmdb_movies
len(list(set(tmdb_budgets['movie'])&set(tmdb_movies['title'])))

1699

In [166]:
# 2299 btw bom & tmdb_movies
len(list(set(bom['title'])&set(tmdb_movies['title'])))

2299

In [215]:
#1232 btw tmdb_budgets & bom

In [213]:
len(list(set(tmdb_budgets['movie'])&set(bom['title'])))

1232

In [214]:
#1164 among tmdb_budgets & bom
len(list(set(bom['title'])&set(tmdb_movies['title'])&set(tmdb_budgets['movie'])))

1164

In [218]:
bom.size, tmdb_movies.size, tmdb_budgets.size, imdb_tl_basics.size

(16935, 265170, 19719, 876864)

In [219]:
imdb_tl_basics.columns

Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [220]:
len(set(imdb_tl_basics['primary_title'])&set(bom['title']))

2605

In [222]:
len(set(imdb_tl_basics['primary_title'])&set(tmdb_movies['title']))

14947

In [223]:
len(set(imdb_tl_basics['primary_title'])&set(tmdb_budgets['movie']))

1797

## Create tables containing box, budget & rating information
- by  Joining Tables from **tmdb, imdb & bom**

### imdb: "imdb_tl_ratings" & "imdb_tl_basics"
- join on 'tconst'
- cols of interest:
    -

In [224]:
imdb_tl_basics.head(2)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [226]:
imdb_tl_ratings.head(2)

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

In [229]:
imdb_tl_basics.size, imdb_tl_ratings.size

(876864, 221568)

In [228]:
len(set(imdb_tl_basics['tconst'])&set(imdb_tl_ratings['tconst']))

73856

** 1st things 1st**
1. Graphs
2. Presentation

In [232]:
tmdb_movies.head(3)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368

In [235]:
a =list(set(tmdb_movies['title'])&set(tmdb_budgets['movie']))
b =list(set(tmdb_movies['original_title'])&set(tmdb_budgets['movie']))
len(set(a+b))

1725

In [238]:
tmdb_movies.shape, tmdb_budgets.shape

((26517, 10), (2191, 9))

tmdb_movies on genre id
want output
```
cuisine_1,id_1,ingredient_1
cuisine_1,id_1,ingredient_2
cuisine_1,id_1,ingredient_3
cuisine_2,id_2,ingredient_4
cuisine_2,id_2,ingredient_5
```

```python
# convert s to list of digits
>>> s = "h3110 23 cat 444.4 rabbit 11 2 dog"
>>> [int(s) for s in str.split() if s.isdigit()]
[23, 11, 2]

# strip all punctuation from a string 
import string
s.translate(str.maketrans('', '', string.punctuation))
```

In [267]:
s = '[12, 14, 10751]'
s = s.translate(str.maketrans('', '', string.punctuation))
[int(n) for n in s.split()]

[12, 14, 10751]

In [270]:
def str_num(s):
    ''' convert s to a list of numbers
        example: 
        input: s = '[12, 14, 10751]'
        output: [12, 14, 10751]   
    '''
    # strip all punctuation from a string 
    s = s.translate(str.maketrans('', '', string.punctuation))
    # string to list 
    s_list = [int(n) for n in s.split()]
    return s_list

tmdb_movies['genre_ids'].apply(str_num)

0                 [12, 14, 10751]
1             [14, 12, 16, 10751]
2                   [12, 28, 878]
3                 [16, 35, 10751]
4                   [28, 878, 12]
5                 [12, 14, 10751]
6               [28, 12, 14, 878]
7                 [16, 10751, 35]
8                 [16, 10751, 35]
9        [16, 28, 35, 10751, 878]
10                [16, 35, 10751]
11                [10751, 14, 12]
12                   [53, 12, 28]
13                    [16, 10751]
14                       [27, 80]
15            [12, 14, 18, 10749]
16                  [28, 53, 878]
17                 [10402, 10749]
18                   [28, 18, 53]
19                 [18, 53, 9648]
20             [28, 18, 9648, 53]
21                       [28, 35]
22                [12, 10751, 14]
23                    [18, 10749]
24           [53, 28, 12, 35, 80]
25                       [18, 36]
26               [28, 35, 80, 53]
27            [28, 12, 10751, 14]
28              [28, 878, 12, 53]
29                           [18]
                   ...
26487                        [27]
26488                        [27]
26489                        [99]
26490                        [27]
26491                        [53]
26492                          []
26493                        [27]
26494                        [18]
26495                          []
26496                        [99]
26497                          []
26498                          []
26499                        [27]
26500                          []
26501                        [27]
26502                        [16]
26503                        [99]
26504                [27, 35, 27]
26505                    [27, 53]
26506                          []
26507                        [99]
26508                        [16]
26509                        [27]
26510                        [99]
26511                        [99]
26512                    [27, 18]
26513                    [18, 53]
26514                [14, 28, 12]
26515             [10751, 12, 28]
26516                    [53, 27]
Name: genre_ids, Length: 26517, dtype: object

In [240]:
# 1. covert genre_ids [12, 14, 10751] in to columns
tmdb_movies['genre_ids'].apply(pd.Series)

                              0
0               [12, 14, 10751]
1           [14, 12, 16, 10751]
2                 [12, 28, 878]
3               [16, 35, 10751]
4                 [28, 878, 12]
5               [12, 14, 10751]
6             [28, 12, 14, 878]
7               [16, 10751, 35]
8               [16, 10751, 35]
9      [16, 28, 35, 10751, 878]
10              [16, 35, 10751]
11              [10751, 14, 12]
12                 [53, 12, 28]
13                  [16, 10751]
14                     [27, 80]
15          [12, 14, 18, 10749]
16                [28, 53, 878]
17               [10402, 10749]
18                 [28, 18, 53]
19               [18, 53, 9648]
20           [28, 18, 9648, 53]
21                     [28, 35]
22              [12, 10751, 14]
23                  [18, 10749]
24         [53, 28, 12, 35, 80]
25                     [18, 36]
26             [28, 35, 80, 53]
27          [28, 12, 10751, 14]
28            [28, 878, 12, 53]
29                         [18]
...                         ...
26487                      [27]
26488                      [27]
26489                      [99]
26490                      [27]
26491                      [53]
26492                        []
26493                      [27]
26494                      [18]
26495                        []
26496                      [99]
26497                        []
26498                        []
26499                      [27]
26500                        []
26501                      [27]
26502                      [16]
26503                      [99]
26504              [27, 35, 27]
26505                  [27, 53]
26506                        []
26507                      [99]
26508                      [16]
26509                      [27]
26510                      [99]
26511                      [99]
26512                  [27, 18]
26513                  [18, 53]
26514              [14, 28, 12]
26515           [10751, 12, 28]
26516                  [53, 27]

[26517 rows x 1 columns]